Revit 2027 API
ConnectionValidationWarning.Reason Property
 Enumeration for reason of warning.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectionWarning Reason { get; }
Public ReadOnly Property Reason As ConnectionWarning
	Get
public:
property ConnectionWarning Reason {
	ConnectionWarning get ();
}
member Reason : ConnectionWarning with get
Property Value
ConnectionWarning
See Also
Reference
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace